spec/spec/SVWS/IntegrationPlatform/Examples/BlockCardRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://sv.bpc.in/SVIP">
    <soapenv:Header/>
    <soapenv:Body>
    <int:IFX>
        <CardStatusModRq>
            <RqUID>3127a63b-d8f1-4bed-94ad-d96ffd321a86</RqUID>
            <MsgRqHdr>
                <ContextRqHdr>
                    <NetworkTrnData>
                        <NetworkOwner>Branch</NetworkOwner>
                        <TerminalIdent>10000073</TerminalIdent>
                    </NetworkTrnData>
                    <ClientDt>2011-08-08T12:45:45</ClientDt>
                </ContextRqHdr>
            </MsgRqHdr>
            <CardKeys>
                <CardNum>6708746000700005</CardNum>
            </CardKeys>
            <CardStatus>
                <CardStatusCode>Blocked</CardStatusCode>
                <StatusReason>CSTS0020</StatusReason>
            </CardStatus>
        </CardStatusModRq>
    </int:IFX>
    </soapenv:Body>
</soapenv:Envelope>